assets/js/c650155c.d2fdae3f.js

"use strict";(self.webpackChunkdocumentation=self.webpackChunkdocumentation||[]).push([[10604],{3905:(e,t,n)=>{n.d(t,{Zo:()=>p,kt:()=>c});var a=n(67294);function s(e,t,n){return t in e?Object.defineProperty(e,t,{value:n,enumerable:!0,configurable:!0,writable:!0}):e[t]=n,e}function r(e,t){var n=Object.keys(e);if(Object.getOwnPropertySymbols){var a=Object.getOwnPropertySymbols(e);t&&(a=a.filter((function(t){return Object.getOwnPropertyDescriptor(e,t).enumerable}))),n.push.apply(n,a)}return n}function o(e){for(var t=1;t<arguments.length;t++){var n=null!=arguments[t]?arguments[t]:{};t%2?r(Object(n),!0).forEach((function(t){s(e,t,n[t])})):Object.getOwnPropertyDescriptors?Object.defineProperties(e,Object.getOwnPropertyDescriptors(n)):r(Object(n)).forEach((function(t){Object.defineProperty(e,t,Object.getOwnPropertyDescriptor(n,t))}))}return e}function l(e,t){if(null==e)return{};var n,a,s=function(e,t){if(null==e)return{};var n,a,s={},r=Object.keys(e);for(a=0;a<r.length;a++)n=r[a],t.indexOf(n)>=0||(s[n]=e[n]);return s}(e,t);if(Object.getOwnPropertySymbols){var r=Object.getOwnPropertySymbols(e);for(a=0;a<r.length;a++)n=r[a],t.indexOf(n)>=0||Object.prototype.propertyIsEnumerable.call(e,n)&&(s[n]=e[n])}return s}var i=a.createContext({}),u=function(e){var t=a.useContext(i),n=t;return e&&(n="function"==typeof e?e(t):o(o({},t),e)),n},p=function(e){var t=u(e.components);return a.createElement(i.Provider,{value:t},e.children)},d="mdxType",h={inlineCode:"code",wrapper:function(e){var t=e.children;return a.createElement(a.Fragment,{},t)}},m=a.forwardRef((function(e,t){var n=e.components,s=e.mdxType,r=e.originalType,i=e.parentName,p=l(e,["components","mdxType","originalType","parentName"]),d=u(n),m=s,c=d["".concat(i,".").concat(m)]||d[m]||h[m]||r;return n?a.createElement(c,o(o({ref:t},p),{},{components:n})):a.createElement(c,o({ref:t},p))}));function c(e,t){var n=arguments,s=t&&t.mdxType;if("string"==typeof e||s){var r=n.length,o=new Array(r);o[0]=m;var l={};for(var i in t)hasOwnProperty.call(t,i)&&(l[i]=t[i]);l.originalType=e,l[d]="string"==typeof e?e:s,o[1]=l;for(var u=2;u<r;u++)o[u]=n[u];return a.createElement.apply(null,o)}return a.createElement.apply(null,n)}m.displayName="MDXCreateElement"},12401:(e,t,n)=>{n.r(t),n.d(t,{assets:()=>i,contentTitle:()=>o,default:()=>h,frontMatter:()=>r,metadata:()=>l,toc:()=>u});var a=n(87462),s=(n(67294),n(3905));const r={sidebar_position:1},o="Quickstart",l={unversionedId:"apis/for-sellers/hotel-push-sellers-api/quickstart",id:"apis/for-sellers/hotel-push-sellers-api/quickstart",title:"Quickstart",description:"Introduction",source:"@site/docs/apis/for-sellers/hotel-push-sellers-api/quickstart.mdx",sourceDirName:"apis/for-sellers/hotel-push-sellers-api",slug:"/apis/for-sellers/hotel-push-sellers-api/quickstart",permalink:"/docs/apis/for-sellers/hotel-push-sellers-api/quickstart",draft:!1,editUrl:"https://github.com/Travelgate/documentation/tree/main/docs/apis/for-sellers/hotel-push-sellers-api/quickstart.mdx",tags:[],version:"current",sidebarPosition:1,frontMatter:{sidebar_position:1},sidebar:"docsSidebar",previous:{title:"Cancel",permalink:"/docs/apis/for-buyers/legacy-pull-buyers-api/booking-management/cancel"},next:{title:"Endpoint",permalink:"/docs/apis/for-sellers/hotel-push-sellers-api/making-requests/endpoint"}},i={},u=[{value:"Introduction",id:"introduction",level:2},{value:"Let&#39;s Get Started: How to Make your First Sale!",id:"lets-get-started-how-to-make-your-first-sale",level:2},{value:"Prerequisites",id:"prerequisites",level:3},{value:"API Endpoint",id:"api-endpoint",level:4},{value:"Request Headers",id:"request-headers",level:4},{value:"Supported Operations",id:"supported-operations",level:4},{value:"1. Retrieve the setup of the product (Hotel, Rate Plan, Room).",id:"1-retrieve-the-setup-of-the-product-hotel-rate-plan-room",level:3},{value:"2. Push the availability",id:"2-push-the-availability",level:3},{value:"3. Push the rates",id:"3-push-the-rates",level:3},{value:"Next steps",id:"next-steps",level:2}],p={toc:u},d="wrapper";function h(e){let{components:t,...n}=e;return(0,s.kt)(d,(0,a.Z)({},p,n,{components:t,mdxType:"MDXLayout"}),(0,s.kt)("h1",{id:"quickstart"},"Quickstart"),(0,s.kt)("h2",{id:"introduction"},"Introduction"),(0,s.kt)("p",null,"By combining the Hotel Push Sellers API and ",(0,s.kt)("a",{parentName:"p",href:"../../../apps/inventory/extranet/overview"},"Inventory Tool"),", Channel Managers and Hotel Distributors can effectively ",(0,s.kt)("strong",{parentName:"p"},"push")," their products into a Travelgate database, thereby making them accessible to Travelgate Buyers."),(0,s.kt)("p",null,"As a standard practice, Buyers usually configure the setup (hotels, rate plans, and rooms) within the ",(0,s.kt)("a",{parentName:"p",href:"https://inventory.xmltravelgate.com/Account/Login?ReturnUrl=%2f"},"Inventory Extranet"),". Subsequently, Sellers push both availability and rates. Consequently, Travelgate Buyers gain access to these products through three distinct methods: either through Pull, using our ",(0,s.kt)("a",{parentName:"p",href:"../../for-buyers/hotel-x-pull-buyers-api/quickstart"},"Hotel-X solution"),"; through Push, utilizing our ",(0,s.kt)("a",{parentName:"p",href:"../../for-buyers/channel-x-push-buyers-api/quickstart"},"Channel-X solution"),"; or via a Flat File solution."),(0,s.kt)("p",null,"\xa0","\n",(0,s.kt)("img",{parentName:"p",src:"https://storage.travelgate.com/docs/push_seller_api.svg",alt:"Hotel Push Seller Overview"})),(0,s.kt)("h2",{id:"lets-get-started-how-to-make-your-first-sale"},"Let's Get Started: How to Make your First Sale!"),(0,s.kt)("p",null,"The Hotel Push Sellers API provides a robust XML-based API that will enable you to push all your products to our Inventory Tool, making them accessible for Buyers. If you're a Channel Manager or Supplier seeking a push integration, please follow the next steps."),(0,s.kt)("h3",{id:"prerequisites"},"Prerequisites"),(0,s.kt)("h4",{id:"api-endpoint"},"API Endpoint"),(0,s.kt)("p",null,"Hotel Push Seller API, being a XML-based API, utilizes a single endpoint for all operations:"),(0,s.kt)("pre",null,(0,s.kt)("code",{parentName:"pre",className:"language-html"},"https://pushprovider.xmltravelgate.com/Service/Hotel/Provider/ProviderGEN.svc\n")),(0,s.kt)("h4",{id:"request-headers"},"Request Headers"),(0,s.kt)("p",null,'To interact with the API, you\'ll need to include the Authentication request header, which employs two levels of authentication, namely "Security" and "POS":'),(0,s.kt)("ol",null,(0,s.kt)("li",{parentName:"ol"},(0,s.kt)("p",{parentName:"li"},"Security Level: User and password of our Inventory Tool System.")),(0,s.kt)("li",{parentName:"ol"},(0,s.kt)("p",{parentName:"li"},"POS Level: It comprises two fields: RequestorID, which represents the seller code assigned to initiate the request, and CompanyName, which signifies the buyer code assigned to receive the updates."))),(0,s.kt)("pre",null,(0,s.kt)("code",{parentName:"pre",className:"language-html"},'<SOAP-ENV:Envelope xmlns:SOAP-ENV = "http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1 = "http://www.opentravel.org/OTA/2003/05" xmlns:ns2 = "http://schemas.xmltravelgate.com/hubpush/provider/2012/10" xmlns:ns3 = "http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">\n <SOAP-ENV:Header>\n     <ns3:Security SOAP-ENV:mustUnderstand = "1">\n         <ns3:UsernameToken>\n             <ns3:Username>username</ns3:Username>\n             <ns3:Password>password</ns3:Password>\n         </ns3:UsernameToken>\n     </ns3:Security>\n </SOAP-ENV:Header>\n <SOAP-ENV:Body>\n     <ns:HotelRatePlanNotif>\x3c!--Your request, ex: HotelAvailNotif, HotelRatePlanInventoryRetrieve ...--\x3e\n         <ns:request>\n             <ns1:POS>\n                 <ns1:Source>\n                     <ns1:RequestorID ID="Seller Code"/>\n                     <ns1:BookingChannel>\n                         <ns1:CompanyName Code="Buyer Code"/>\n                     </ns1:BookingChannel>\n                 </ns1:Source>\n             </ns1:POS>\n             ...\n             ...\n         </ns:request>\n   </ns:HotelRatePlanNotif>\n </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>\n')),(0,s.kt)("admonition",{type:"caution"},(0,s.kt)("p",{parentName:"admonition"},"During the onboarding process, your username and password will be provided. After each connection is established, you'll receive an email with  RequestorID (Seller Code) and CompanyName (Buyer Code) values.")),(0,s.kt)("h4",{id:"supported-operations"},"Supported Operations"),(0,s.kt)("p",null,"In the context of the Hotel Push Sellers API, you can both push and retrieve information about ",(0,s.kt)("strong",{parentName:"p"},"Availability"),", ",(0,s.kt)("strong",{parentName:"p"},"Rates"),", and ",(0,s.kt)("strong",{parentName:"p"},"Inventory")," (ARI)."),(0,s.kt)("ul",null,(0,s.kt)("li",{parentName:"ul"},(0,s.kt)("p",{parentName:"li"},"When you ",(0,s.kt)("strong",{parentName:"p"},"push data"),", you'll need to submit a request to Travelgate's system with all the necessary information about inventory, availability or rate. If everything goes smoothly, you'll receive a successful response and the data will be stored in a Travelgate database; otherwise, you'll receive an error message.")),(0,s.kt)("li",{parentName:"ul"},(0,s.kt)("p",{parentName:"li"},"On the other hand, when you ",(0,s.kt)("strong",{parentName:"p"},"retrieve data"),", you'll need to send a request to Travelgate's system to get the information you're looking for. If everything goes well, we'll send you the data that was previously stored in our system as a response; otherwise, we'll notify you of an error."))),(0,s.kt)("p",null,"But now, this quickstart guide will focus on the basics of using the Hotel Push Sellers API to push the ARI (Availability, Rates, and Inventory) to Travelgate's system and begin making the first sales, so let's dive in and get started!"),(0,s.kt)("h3",{id:"1-retrieve-the-setup-of-the-product-hotel-rate-plan-room"},"1. Retrieve the setup of the product (Hotel, Rate Plan, Room)."),(0,s.kt)("p",null,"The ",(0,s.kt)("inlineCode",{parentName:"p"},"HotelRatePlanInventory")," message is where the adventure starts! The aim of this step is to setup (hotel, rate plans, and rooms) your inventory. This step is typically performed by the Buyer; who usually accesses our ",(0,s.kt)("a",{parentName:"p",href:"https://inventory.xmltravelgate.com/Account/Login?ReturnUrl=%2f"},"Inventory Extranet")," to complete the setup there. Consequently, the Seller only needs to retrieve the data to map it into their system and subsequently push the availability and rates. "),(0,s.kt)("admonition",{type:"info"},(0,s.kt)("p",{parentName:"admonition"},"If the Seller prefers to take charge of the inventory setup, it is also possible through ",(0,s.kt)("a",{parentName:"p",href:"availability-rates-and-inventory/inventory/inventory-push"},"inventory push")," method.")),(0,s.kt)("pre",null,(0,s.kt)("code",{parentName:"pre",className:"language-html"},'<Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/soap/envelope/">\n   <Header>\n      <o:Security xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">\n         <o:UsernameToken Id="xnExysS120i8nwXu90DOToFTjoyuWpFe">\n            <o:Username>username</o:Username>\n            <o:Password>password</o:Password>\n         </o:UsernameToken>\n      </o:Security>\n   </Header>\n   <Body>\n      <HotelRatePlanInventoryRetrieve xmlns="http://schemas.xmltravelgate.com/hubpush/provider/2012/10">\n         <request Version="0">\n            <POS xmlns="http://www.opentravel.org/OTA/2003/05">\n               <Source>\n                  <RequestorID ID="Seller Code"/>\n                  <BookingChannel>\n                     <CompanyName Code="Buyer Code"/>\n                  </BookingChannel>\n               </Source>\n            </POS>\n            <RatePlans xmlns="http://www.opentravel.org/OTA/2003/05">\n               <RatePlan>\n                  <HotelRef HotelCode="2"/>\n               </RatePlan>\n            </RatePlans>\n         </request>\n      </HotelRatePlanInventoryRetrieve>\n   </Body>\n</Envelope>\n')),(0,s.kt)("h3",{id:"2-push-the-availability"},"2. Push the availability"),(0,s.kt)("p",null,"After a careful review of all the inventory setup retrieved in the previous step, it's time to proceed and push availability to the product."),(0,s.kt)("pre",null,(0,s.kt)("code",{parentName:"pre",className:"language-html"},'<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.opentravel.org/OTA/2003/05" xmlns:ns2="http://schemas.xmltravelgate.com/hubpush/provider/2012/10" xmlns:ns3="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">\n   <SOAP-ENV:Header>\n      <ns3:Security SOAP-ENV:mustUnderstand="1">\n         <ns3:UsernameToken>\n            <ns3:Username>username</ns3:Username>\n            <ns3:Password>password</ns3:Password>\n         </ns3:UsernameToken>\n      </ns3:Security>\n   </SOAP-ENV:Header>\n   <SOAP-ENV:Body>\n      <ns2:HotelAvailNotif>\n         <ns2:request>\n            <ns1:POS>\n               <ns1:Source>\n                  <ns1:RequestorID ID="Seller Code"/>\n                  <ns1:BookingChannel>\n                     <ns1:CompanyName Code="Buyer Code"/>\n                  </ns1:BookingChannel>\n               </ns1:Source>\n            </ns1:POS>\n            <ns1:AvailStatusMessages HotelCode="2">\n               <ns1:AvailStatusMessage BookingLimit="13">\n                  <ns1:StatusApplicationControl Start="2023-12-20" End="2023-12-22" PromotionCode = "25" RatePlanCode="BAR" Mon="true" Tue="true" Weds="true" Thur="true" Fri="true" Sat="true" Sun="true"/>\n               </ns1:AvailStatusMessage>\n               <ns1:AvailStatusMessage>\n                  <ns1:StatusApplicationControl Start="2023-12-20" End="2023-12-22" RatePlanCode="BAR" InvCode="STD3" Mon="true" Tue="true" Weds="true" Thur="true" Fri="true" Sat="true" Sun="true"/>\n                  <ns1:LengthsOfStay>\n                     <ns1:LengthOfStay Time="1" TimeUnit="Day" MinMaxMessageType="MinLOS"/>\n                     <ns1:LengthOfStay Time="28" TimeUnit="Day" MinMaxMessageType="MaxLOS"/>\n                  </ns1:LengthsOfStay>\n                  <ns1:RestrictionStatus Restriction="Master" Status="Open"/>\n               </ns1:AvailStatusMessage>\n               <ns1:AvailStatusMessage>\n                  <ns1:StatusApplicationControl Start="2023-12-20" End="2023-12-22" RatePlanCode="BAR" InvCode="STD3" Mon="true" Tue="true" Weds="true" Thur="true" Fri="true" Sat="true" Sun="true"/>\n                  <ns1:RestrictionStatus Restriction="Arrival" Status="Open"/>\n               </ns1:AvailStatusMessage>\n            </ns1:AvailStatusMessages>\n         </ns2:request>\n      </ns2:HotelAvailNotif>\n   </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>\n')),(0,s.kt)("h3",{id:"3-push-the-rates"},"3. Push the rates"),(0,s.kt)("p",null,"You're almost there! After pushing the availability, it's time to finish the process by pushing the rates. Once this is done, all the information will be in our database, and Buyers will be able to start making their first reservations."),(0,s.kt)("pre",null,(0,s.kt)("code",{parentName:"pre",className:"language-html"},'<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://schemas.xmltravelgate.com/hubpush/provider/2012/10" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:ns1="http://www.opentravel.org/OTA/2003/05">\n   <s:Header>\n      <wsse:Security>\n         <wsse:UsernameToken>\n            <wsse:Username>username</wsse:Username>\n            <wsse:Password>password</wsse:Password>\n         </wsse:UsernameToken>\n      </wsse:Security>\n   </s:Header>\n   <s:Body>\n      <ns:HotelRatePlanNotif>\n         <ns:request>\n            <ns1:POS>\n               <ns1:Source>\n                  <ns1:RequestorID ID="Seller Code"/>\n                  <ns1:BookingChannel>\n                     <ns1:CompanyName Code="Buyer Code"/>\n                  </ns1:BookingChannel>\n               </ns1:Source>\n            </ns1:POS>\n            <ns1:RatePlans HotelCode="2">\n                <RatePlan CurrencyCode="EUR" RatePlanCode="BAR" RateReturn="false" FreeChild="false" FreeBaby="false" RatePlanStatusType="Active">\n                    <Rates>\n                        <Rate Start="2024-01-01" End="2024-01-01">\n                            <BaseByGuestAmts>\n                                <BaseByGuestAmt AmountAfterTax="100" Type="25" />\n                            </BaseByGuestAmts>\n                        </Rate>\n                    </Rates>\n                    <SellableProducts>\n                        <SellableProduct InvCode="SNG" InvType="ROOM" />\n                    </SellableProducts>\n                </RatePlan>\n                <RatePlan CurrencyCode="EUR" RatePlanCode="BAR" RateReturn="false" FreeChild="false" FreeBaby="false" RatePlanStatusType="Active">\n                    <Rates>\n                        <Rate Start="2024-01-02" End="2024-01-02">\n                            <BaseByGuestAmts>\n                                <BaseByGuestAmt AmountAfterTax="100" Type="25" />\n                            </BaseByGuestAmts>\n                        </Rate>\n                    </Rates>\n                    <Supplements>\n                        <Supplement AgeQualifyingCode="10" Amount="10" Start="2024-01-02" End="2024-01-02" SupplementType="Board" InvCode="19" />\n                        <Supplement AgeQualifyingCode="8" Amount="5" Start="2024-01-02" End="2024-01-02" SupplementType="Board" InvCode="19" />\n                        <Supplement AgeQualifyingCode="7" Amount="0" Start="2024-01-02" End="2024-01-02" SupplementType="Board" InvCode="19" />\n                    </Supplements>\n                    <SellableProducts>\n                        <SellableProduct InvCode="SNG" InvType="ROOM" />\n                    </SellableProducts>\n                </RatePlan>\n            </RatePlans>\n         </request>\n      </HotelRatePlanNotif>\n  </s:Body>\n</s:Envelope>\n')),(0,s.kt)("h2",{id:"next-steps"},"Next steps"),(0,s.kt)("p",null,"Congratulations on completing this quickstart tutorial! \ud83c\udf89 You've successfully learned the basics of making your first sale. But there's a world of knowledge waiting for you:"),(0,s.kt)("ul",null,(0,s.kt)("li",{parentName:"ul"},"Explore the ",(0,s.kt)("a",{parentName:"li",href:"../hotel-push-sellers-api/making-requests/endpoint"},"Making Requests")," section to dive deep into how a XML API works and maximize its performance."),(0,s.kt)("li",{parentName:"ul"},"Discover various methods/messages grouped by the following actions:",(0,s.kt)("ul",{parentName:"li"},(0,s.kt)("li",{parentName:"ul"},(0,s.kt)("a",{parentName:"li",href:"./availability-rates-and-inventory/inventory/inventory-push"},"Inventory"),": Push the inventory setup (hotel, rate, room)."),(0,s.kt)("li",{parentName:"ul"},(0,s.kt)("a",{parentName:"li",href:"./availability-rates-and-inventory/availability/availability-push"},"Availability")," and ",(0,s.kt)("a",{parentName:"li",href:"./availability-rates-and-inventory/rates/rates-push"},"Rate"),": Push rate availability, allotment conditions and rate prices and supplements."),(0,s.kt)("li",{parentName:"ul"},(0,s.kt)("a",{parentName:"li",href:"./booking-management/overview"},"Manage reservations"),": Get the hang of reservation management.")))),(0,s.kt)("p",null,"Our documentation is a treasure trove of additional features and functionalities to enhance your business. To uncover these valuable resources, explore our documentation further and make the most of these methods. Enjoy your journey!"))}h.isMDXComponent=!0}}]);